29) /home/t/www3/tests/RangesTest.php:7    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1bca0969f49afb142c61724a77703f0a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 2]], Ranges::addUsed([[1, 1]], 2));
+        $this->assertEquals([[1, 2]], Ranges::addUsed([[0, 1]], 2));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

F

Time: 33 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test0
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
+        0 => 0

/home/t/www3/tests/RangesTest.php:9

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

30) /home/t/www3/tests/RangesTest.php:7    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.839c8adcae2ba36f89f2b0314332ba21.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 2]], Ranges::addUsed([[1, 1]], 2));
+        $this->assertEquals([[1, 2]], Ranges::addUsed([[1, 0]], 2));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

F

Time: 89 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test0
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
         0 => 1
-        1 => 2
+        1 => 0
     )
+    1 => Array (...)

/home/t/www3/tests/RangesTest.php:9

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

31) /home/t/www3/tests/RangesTest.php:11    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7c64d9fb7160a44a6d8a65e9dd0e0310.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 3]], Ranges::addUsed([[2, 3]], 1));
+        $this->assertEquals([[0, 3]], Ranges::addUsed([[2, 3]], 1));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

.F

Time: 31 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test1
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:13

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

32) /home/t/www3/tests/RangesTest.php:11    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c13677171a396c976814fc4567996713.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 3]], Ranges::addUsed([[2, 3]], 1));
+        $this->assertEquals([[1, 3]], Ranges::addUsed([[2, 3]], 0));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

.F

Time: 31 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test1
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
-        1 => 3
+        0 => 0
+        1 => 0
     )
+    1 => Array (...)

/home/t/www3/tests/RangesTest.php:13

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

33) /home/t/www3/tests/RangesTest.php:15    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.02ca9729deac327bd0d99b2cd356c12b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1], [3, 4]], Ranges::addUsed([[3, 4]], 1));
+        $this->assertEquals([[0, 1], [3, 4]], Ranges::addUsed([[3, 4]], 1));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

..F

Time: 35 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test2
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:17

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

34) /home/t/www3/tests/RangesTest.php:15    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.26f2bcc14ff6dfbaed2ef64f3ea02320.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1], [3, 4]], Ranges::addUsed([[3, 4]], 1));
+        $this->assertEquals([[1, 0], [3, 4]], Ranges::addUsed([[3, 4]], 1));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

..F

Time: 33 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test2
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
         0 => 1
-        1 => 0
+        1 => 1

/home/t/www3/tests/RangesTest.php:17

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

35) /home/t/www3/tests/RangesTest.php:15    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2024940afd5305ee194b82a1cd692ba6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1], [3, 4]], Ranges::addUsed([[3, 4]], 1));
+        $this->assertEquals([[1, 1], [3, 4]], Ranges::addUsed([[3, 4]], 0));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

..F

Time: 35 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test2
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
-        1 => 1
+        0 => 0
+        1 => 0

/home/t/www3/tests/RangesTest.php:17

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

36) /home/t/www3/tests/RangesTest.php:19    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bf830581b8339d51e226af175da41738.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 2], [4, 4]], Ranges::addUsed([[1, 2]], 4));
+        $this->assertEquals([[0, 2], [4, 4]], Ranges::addUsed([[1, 2]], 4));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

...F

Time: 31 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test3
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:21

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

37) /home/t/www3/tests/RangesTest.php:19    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fbf97b31710300f0972df7537e1ec161.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 2], [4, 4]], Ranges::addUsed([[1, 2]], 4));
+        $this->assertEquals([[1, 2], [4, 4]], Ranges::addUsed([[0, 2]], 4));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

...F

Time: 34 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test3
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
+        0 => 0

/home/t/www3/tests/RangesTest.php:21

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

38) /home/t/www3/tests/RangesTest.php:23    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8c676740b61c836dbff6979089a1f18e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 4]], Ranges::addUsed([[1, 2], [3, 4]], 4));
+        $this->assertEquals([[0, 4]], Ranges::addUsed([[1, 2], [3, 4]], 4));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

....F

Time: 35 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test4
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:25

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

39) /home/t/www3/tests/RangesTest.php:23    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.da7ed6fcd5e49c3530bebc374f87ec47.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 4]], Ranges::addUsed([[1, 2], [3, 4]], 4));
+        $this->assertEquals([[1, 4]], Ranges::addUsed([[0, 2], [3, 4]], 4));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

....F

Time: 34 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test4
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
+        0 => 0

/home/t/www3/tests/RangesTest.php:25

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

40) /home/t/www3/tests/RangesTest.php:27    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fe403d99f58917f48ac5811cf48a3d91.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 5]], Ranges::addUsed([[1, 2], [4, 5]], 3));
+        $this->assertEquals([[0, 5]], Ranges::addUsed([[1, 2], [4, 5]], 3));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

.....F

Time: 41 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test5
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:29

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

41) /home/t/www3/tests/RangesTest.php:27    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.53acffcf908826dfeb4695034fcf1c86.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 5]], Ranges::addUsed([[1, 2], [4, 5]], 3));
+        $this->assertEquals([[1, 5]], Ranges::addUsed([[0, 2], [4, 5]], 3));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

.....F

Time: 35 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test5
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
+        0 => 0

/home/t/www3/tests/RangesTest.php:29

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

42) /home/t/www3/tests/RangesTest.php:31    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c97b2e0cbb4b649f6e1bd457e42e2885.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 3]], Ranges::addUsed([[1, 2]], 3));
+        $this->assertEquals([[0, 3]], Ranges::addUsed([[1, 2]], 3));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

......F

Time: 31 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test6
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:33

FAILURES!
Tests: 7, Assertions: 7, Failures: 1.

43) /home/t/www3/tests/RangesTest.php:31    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c3f95b19e55790712a19a331cec3ce20.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 3]], Ranges::addUsed([[1, 2]], 3));
+        $this->assertEquals([[1, 3]], Ranges::addUsed([[0, 2]], 3));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

......F

Time: 45 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test6
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
+        0 => 0

/home/t/www3/tests/RangesTest.php:33

FAILURES!
Tests: 7, Assertions: 7, Failures: 1.

44) /home/t/www3/tests/RangesTest.php:35    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9549e8ab8a70ca7c6ed940d8fedfe9c1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 2], [4, 4], [6, 7]], Ranges::addUsed([[1, 2], [6, 7]], 4));
+        $this->assertEquals([[0, 2], [4, 4], [6, 7]], Ranges::addUsed([[1, 2], [6, 7]], 4));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

.......F

Time: 37 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test7
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:37

FAILURES!
Tests: 8, Assertions: 8, Failures: 1.

45) /home/t/www3/tests/RangesTest.php:35    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2ea0c032f8f48523932ee5223289a8c9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 2], [4, 4], [6, 7]], Ranges::addUsed([[1, 2], [6, 7]], 4));
+        $this->assertEquals([[1, 2], [4, 4], [6, 7]], Ranges::addUsed([[0, 2], [6, 7]], 4));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

.......F

Time: 31 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test7
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
+        0 => 0

/home/t/www3/tests/RangesTest.php:37

FAILURES!
Tests: 8, Assertions: 8, Failures: 1.

46) /home/t/www3/tests/RangesTest.php:39    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b660cb8833285ca193363cb13dc3ad84.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1]], Ranges::addUsed([], 1));
+        $this->assertEquals([[0, 1]], Ranges::addUsed([], 1));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

........F

Time: 33 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test8
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:41

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.

47) /home/t/www3/tests/RangesTest.php:39    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.97a68b43765c5e64c8a588a5db3e9001.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1]], Ranges::addUsed([], 1));
+        $this->assertEquals([[1, 0]], Ranges::addUsed([], 1));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

........F

Time: 33 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test8
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
         0 => 1
-        1 => 0
+        1 => 1

/home/t/www3/tests/RangesTest.php:41

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.

48) /home/t/www3/tests/RangesTest.php:39    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.af4e3fd16fabe03cab523f06dc20ba2a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1]], Ranges::addUsed([], 1));
+        $this->assertEquals([[1, 1]], Ranges::addUsed([], 0));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

........F

Time: 31 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test8
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
-        1 => 1
+        0 => 0
+        1 => 0

/home/t/www3/tests/RangesTest.php:41

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.

49) /home/t/www3/tests/RangesTest.php:43    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4e86f6c8a8ca02535d95c7ee1f040439.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 3]], Ranges::addUsed([[1, 3]], 2));
+        $this->assertEquals([[0, 3]], Ranges::addUsed([[1, 3]], 2));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

.........F

Time: 36 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test9
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:45

FAILURES!
Tests: 10, Assertions: 10, Failures: 1.

50) /home/t/www3/tests/RangesTest.php:43    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d9fd158386db91e8f7666e23354e5000.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 3]], Ranges::addUsed([[1, 3]], 2));
+        $this->assertEquals([[1, 3]], Ranges::addUsed([[0, 3]], 2));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

.........F

Time: 38 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test9
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
+        0 => 0

/home/t/www3/tests/RangesTest.php:45

FAILURES!
Tests: 10, Assertions: 10, Failures: 1.

51) /home/t/www3/tests/RangesTest.php:47    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d7985531112152aa69260a43c6143c01.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1]], Ranges::addUsed([[1, 1]], 1));
+        $this->assertEquals([[0, 1]], Ranges::addUsed([[1, 1]], 1));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

..........F                                                       11 / 11 (100%)

Time: 35 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test10
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 0
+        0 => 1

/home/t/www3/tests/RangesTest.php:49

FAILURES!
Tests: 11, Assertions: 11, Failures: 1.

52) /home/t/www3/tests/RangesTest.php:47    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1e999abf41d23681cee83bf2a43b5cae.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1]], Ranges::addUsed([[1, 1]], 1));
+        $this->assertEquals([[1, 0]], Ranges::addUsed([[1, 1]], 1));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

..........F                                                       11 / 11 (100%)

Time: 36 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test10
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
         0 => 1
-        1 => 0
+        1 => 1

/home/t/www3/tests/RangesTest.php:49

FAILURES!
Tests: 11, Assertions: 11, Failures: 1.

53) /home/t/www3/tests/RangesTest.php:47    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b20a32a0e094f3dd9ffbf5c3e3e6c8c1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1]], Ranges::addUsed([[1, 1]], 1));
+        $this->assertEquals([[1, 1]], Ranges::addUsed([[0, 1]], 1));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

..........F                                                       11 / 11 (100%)

Time: 33 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test10
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
+        0 => 0

/home/t/www3/tests/RangesTest.php:49

FAILURES!
Tests: 11, Assertions: 11, Failures: 1.

54) /home/t/www3/tests/RangesTest.php:47    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionc5CvhK /home/t/www3/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f5f70b2fd00996150902d05ca4f59a7e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
-        $this->assertEquals([[1, 1]], Ranges::addUsed([[1, 1]], 1));
+        $this->assertEquals([[1, 1]], Ranges::addUsed([[1, 1]], 0));

PHPUnit 6.5.5 by Sebastian Bergmann and contributors.

..........F                                                       11 / 11 (100%)

Time: 31 ms, Memory: 4.00MB

There was 1 failure:

1) RangesTests::test10
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => Array (
-        0 => 1
+        0 => 0

/home/t/www3/tests/RangesTest.php:49

FAILURES!
Tests: 11, Assertions: 11, Failures: 1.
